In [59]:
import os
import pandas as pd
import numpy as np

In [61]:
!ls output

dense121_50k_4767.csv
ens_2_models_5000.csv
ens_4_models_50000.csv
ens_4_models_50000_lb08035.csv
ens_4_models_50000_setnan_018.csv
ens_4_models_50000_setnan_035.csv
ens_4_models_50000_setnan_07.csv
ens_5_models.csv
ensemble1.csv
ensemble_50000_3_models.csv
ens_merge_100k_classes_40_30.csv
ens_merge_100k_classes_primary40_second.csv
ens_res50_res101_dense169_3models_50000.csv
ens_res50_res101_dense169_dense121_4models_50000.csv
ens_res50_res101_dense169_se154_4models_50000.csv
sub_10000_6520.csv
sub1.csv
sub_20000_4968.csv
sub_20000_5598.csv
sub2_5000.csv
sub2.csv
sub3_1000.csv
sub_50000_3118.csv
sub_50000_4223.csv
sub_5000_2.csv
sub_all_classes_0418.csv
sub_all_classes_1128.csv
sub_dense169_50000_3637.csv
sub_densenet201_4307.csv
sub_res34_1463_all_classes.csv
sub_res34_1463_all_classes_lb06914.csv
sub_retrieval_0424.csv
sub_retrieval_1.csv
sub_retrieval_cut_095.csv
sub_retrieval_global.csv
sub_retrieval_local_224.csv
sub_retrieval_local.csv
sub_retrieval_rmac_2.csv
sub_retrieval_rmac.csv
sub_senet154_3102_50000.csv
sub_senet154_5800_5000.csv
sub_se_res101_50000_3525.csv
sub_se_res101_test.csv
sub_se_resnet152_4072_50000.csv
sub_seresnext5032x4d_50000_50000_4320.csv
sub_se_resnext50_32x4d_B_50000_4469.csv
sub_vec1.csv

In [93]:
df = pd.read_csv('output/ens_4_models_50000.csv')
df2 = pd.read_csv('output/sub_res34_1463_all_classes.csv')

In [94]:
df['score'] = df.landmarks.map(lambda x: 0. if pd.isna(x) else float(x.split(' ')[1]))
df2['score'] = df2.landmarks.map(lambda x: 0. if pd.isna(x) else float(x.split(' ')[1]))

In [95]:
df.head()

                 id        landmarks     score
0  cb9998b8cdaf6235   64042 0.035033  0.035033
1  30728cf6e50a6bc6   14317 0.113227  0.113227
2  16afbc86b710337d   37768 0.027412  0.027412
3  d29b2166cf522450  201509 0.015100  0.015100
4  dd5c03b20c21cfba  161152 0.071214  0.071214

In [96]:
df2.head()

                 id        landmarks     score
0  cb9998b8cdaf6235   34631 0.008257  0.008257
1  30728cf6e50a6bc6  122142 0.018448  0.018448
2  16afbc86b710337d  113209 0.183845  0.183845
3  d29b2166cf522450   10831 0.016821  0.016821
4  dd5c03b20c21cfba  128977 0.036825  0.036825

In [97]:
df[df.score < 0.07].shape[0] / df.shape[0]

0.6208168016108341

In [98]:
df2[df2.score < 0.05].shape[0] / df2.shape[0]

0.8898838602244633

In [99]:
df.loc[df['score'] < 0.07, 'landmarks'] = np.nan

In [100]:
df.head(10)

                 id        landmarks     score
0  cb9998b8cdaf6235              NaN  0.035033
1  30728cf6e50a6bc6   14317 0.113227  0.113227
2  16afbc86b710337d              NaN  0.027412
3  d29b2166cf522450              NaN  0.015100
4  dd5c03b20c21cfba  161152 0.071214  0.071214
5  0724ed7fbfe67000              NaN  0.020458
6  c67e5d9ef98d533f              NaN  0.042734
7  3c3cf5f86ff4816a              NaN  0.065611
8  fc9ed2682f5031e9   75181 0.070439  0.070439
9  06a0dd0becc09d9e   56957 0.085647  0.085647

In [18]:
df2.loc[df2['score'] < 0.19, 'landmarks'] = np.nan

In [101]:
df2.head(10)

                 id        landmarks     score
0  cb9998b8cdaf6235   34631 0.008257  0.008257
1  30728cf6e50a6bc6  122142 0.018448  0.018448
2  16afbc86b710337d  113209 0.183845  0.183845
3  d29b2166cf522450   10831 0.016821  0.016821
4  dd5c03b20c21cfba  128977 0.036825  0.036825
5  0724ed7fbfe67000  107717 0.058113  0.058113
6  c67e5d9ef98d533f  171683 0.013107  0.013107
7  3c3cf5f86ff4816a  178660 0.016111  0.016111
8  fc9ed2682f5031e9   53894 0.070835  0.070835
9  06a0dd0becc09d9e  186080 0.013267  0.013267

# Merge method1: df as primary,  use df2 is df1 is NaN

In [102]:
df2 = pd.read_csv('output/sub_res34_1463_all_classes.csv')
df2['score'] = df2.landmarks.map(lambda x: 0. if pd.isna(x) else float(x.split(' ')[1]))
df2.head()

                 id        landmarks     score
0  cb9998b8cdaf6235   34631 0.008257  0.008257
1  30728cf6e50a6bc6  122142 0.018448  0.018448
2  16afbc86b710337d  113209 0.183845  0.183845
3  d29b2166cf522450   10831 0.016821  0.016821
4  dd5c03b20c21cfba  128977 0.036825  0.036825

In [92]:
df_merged = df.copy()
df_merged.head()

                 id        landmarks     score
0  cb9998b8cdaf6235   64042 0.035033  0.035033
1  30728cf6e50a6bc6   14317 0.113227  0.113227
2  16afbc86b710337d   37768 0.027412  0.027412
3  d29b2166cf522450  201509 0.015100  0.015100
4  dd5c03b20c21cfba  161152 0.071214  0.071214

In [76]:
df_merged['landmarks2'] = df2.landmarks
df_merged.head()

                 id        landmarks     score       landmarks2
0  cb9998b8cdaf6235              NaN  0.035033   34631 0.008257
1  30728cf6e50a6bc6   14317 0.113227  0.113227  122142 0.018448
2  16afbc86b710337d              NaN  0.027412  113209 0.183845
3  d29b2166cf522450              NaN  0.015100   10831 0.016821
4  dd5c03b20c21cfba  161152 0.071214  0.071214  128977 0.036825

In [77]:
df_merged.loc[df_merged['landmarks'].isna(), 'landmarks'] = df_merged.landmarks2

In [78]:
df_merged.head()

                 id        landmarks     score       landmarks2
0  cb9998b8cdaf6235   34631 0.008257  0.035033   34631 0.008257
1  30728cf6e50a6bc6   14317 0.113227  0.113227  122142 0.018448
2  16afbc86b710337d  113209 0.183845  0.027412  113209 0.183845
3  d29b2166cf522450   10831 0.016821  0.015100   10831 0.016821
4  dd5c03b20c21cfba  161152 0.071214  0.071214  128977 0.036825

In [79]:
print(df2[df2.landmarks.isna()].shape, df_merged[df_merged.landmarks.isna()].shape, df[df.landmarks.isna()].shape)

(4049, 3) (4049, 4) (73072, 3)

In [80]:
df_merged.to_csv('output/ens_merge_50k_all_classes_primary40_second.csv', index=False, columns=['id', 'landmarks'])

In [89]:
df2.tail()

                      id        landmarks     score
117698  acb1f9c42f092e44  113209 0.194579  0.194579
117699  c855de19f6e30bbb   84689 0.005703  0.005703
117700  3cc69ce565d75a33   32201 0.022823  0.022823
117701  7d37d209e813e000  142644 0.008826  0.008826
117702  5246445f426d1d97   56957 0.044951  0.044951

In [90]:
df_merged.tail()

                      id        landmarks     score       landmarks2
117698  acb1f9c42f092e44  113209 0.194579  0.062176  113209 0.194579
117699  c855de19f6e30bbb   84689 0.005703  0.053450   84689 0.005703
117700  3cc69ce565d75a33   37015 0.167273  0.167273   32201 0.022823
117701  7d37d209e813e000  142644 0.008826  0.045496  142644 0.008826
117702  5246445f426d1d97   56957 0.223954  0.223954   56957 0.044951

In [103]:
df2_test=df2.copy()

In [104]:
df2_test['landmarks2'] = df.landmarks
df2_test.head()

                 id        landmarks     score       landmarks2
0  cb9998b8cdaf6235   34631 0.008257  0.008257              NaN
1  30728cf6e50a6bc6  122142 0.018448  0.018448   14317 0.113227
2  16afbc86b710337d  113209 0.183845  0.183845              NaN
3  d29b2166cf522450   10831 0.016821  0.016821              NaN
4  dd5c03b20c21cfba  128977 0.036825  0.036825  161152 0.071214

In [105]:
df2_test.loc[~df2_test.landmarks2.isna(), 'landmarks']=np.nan
df2_test.head()

                 id        landmarks     score       landmarks2
0  cb9998b8cdaf6235   34631 0.008257  0.008257              NaN
1  30728cf6e50a6bc6              NaN  0.018448   14317 0.113227
2  16afbc86b710337d  113209 0.183845  0.183845              NaN
3  d29b2166cf522450   10831 0.016821  0.016821              NaN
4  dd5c03b20c21cfba              NaN  0.036825  161152 0.071214

In [106]:
df2_test.to_csv('output/sub_test_common_corrects_allclasses_50k.csv', index=False, columns=['id', 'landmarks'])

# merge method2: top40, top30

In [35]:
df2.head()

                 id        landmarks     score
0  cb9998b8cdaf6235  189295 0.058669  0.058669
1  30728cf6e50a6bc6  200037 0.065895  0.065895
2  16afbc86b710337d   60643 0.114938  0.114938
3  d29b2166cf522450   10648 0.265826  0.265826
4  dd5c03b20c21cfba  125021 0.951157  0.951157

In [36]:
df2[df2.score < 0.19].shape[0] / df2.shape[0]

0.7094806419547505

In [37]:
df2.loc[df2['score'] < 0.19, 'landmarks'] = np.nan
df2.head()

                 id        landmarks     score
0  cb9998b8cdaf6235              NaN  0.058669
1  30728cf6e50a6bc6              NaN  0.065895
2  16afbc86b710337d              NaN  0.114938
3  d29b2166cf522450   10648 0.265826  0.265826
4  dd5c03b20c21cfba  125021 0.951157  0.951157

In [38]:
df_merged = df.copy()
df_merged.head()

                 id        landmarks     score
0  cb9998b8cdaf6235              NaN  0.035033
1  30728cf6e50a6bc6   14317 0.113227  0.113227
2  16afbc86b710337d              NaN  0.027412
3  d29b2166cf522450              NaN  0.015100
4  dd5c03b20c21cfba  161152 0.071214  0.071214

In [39]:
df_merged[df_merged.landmarks.isna()].shape[0] / df_merged.shape[0]

0.6208168016108341

In [40]:
df_merged['landmarks2'] = df2.landmarks
df_merged.head()

                 id        landmarks     score       landmarks2
0  cb9998b8cdaf6235              NaN  0.035033              NaN
1  30728cf6e50a6bc6   14317 0.113227  0.113227              NaN
2  16afbc86b710337d              NaN  0.027412              NaN
3  d29b2166cf522450              NaN  0.015100   10648 0.265826
4  dd5c03b20c21cfba  161152 0.071214  0.071214  125021 0.951157

In [41]:
df_merged.loc[df_merged['landmarks'].isna(), 'landmarks'] = df_merged.landmarks2
df_merged.head()

                 id        landmarks     score       landmarks2
0  cb9998b8cdaf6235              NaN  0.035033              NaN
1  30728cf6e50a6bc6   14317 0.113227  0.113227              NaN
2  16afbc86b710337d              NaN  0.027412              NaN
3  d29b2166cf522450   10648 0.265826  0.015100   10648 0.265826
4  dd5c03b20c21cfba  161152 0.071214  0.071214  125021 0.951157

In [42]:
df_merged[df_merged.landmarks.isna()].shape[0] / df_merged.shape[0]

0.47573978573188447

In [43]:
df_merged.to_csv('output/ens_merge_100k_classes_40_30.csv', index=False, columns=['id', 'landmarks'])

In [49]:
df.head()

                 id        landmarks     score
0  cb9998b8cdaf6235              NaN  0.035033
1  30728cf6e50a6bc6   14317 0.113227  0.113227
2  16afbc86b710337d              NaN  0.027412
3  d29b2166cf522450              NaN  0.015100
4  dd5c03b20c21cfba  161152 0.071214  0.071214

In [58]:
(df_merged.landmarks == df.landmarks).astype(np.int).sum()

44631

In [54]:
(df_merged.landmarks.isna()).astype(np.int).sum()

55996

In [56]:
 (df_merged.landmarks == df2.landmarks).astype(np.int).sum()

17076

In [31]:
df.to_csv('output/ens_4_models_50000_setnan_018.csv', index=False, columns=['id', 'landmarks'])

In [36]:
df.loc[df['score'] < 0.035, 'landmarks'] = np.nan

In [37]:
df.to_csv('output/ens_4_models_50000_setnan_035.csv', index=False, columns=['id', 'landmarks'])

In [42]:
df.loc[df['score'] < 0.07, 'landmarks'] = np.nan

In [43]:
df.to_csv('output/ens_4_models_50000_setnan_07.csv', index=False, columns=['id', 'landmarks'])

In [44]:
df.head()

                 id        landmarks     score
0  cb9998b8cdaf6235              NaN  0.035033
1  30728cf6e50a6bc6   14317 0.113227  0.113227
2  16afbc86b710337d              NaN  0.027412
3  d29b2166cf522450              NaN  0.015100
4  dd5c03b20c21cfba  161152 0.071214  0.071214